def my_func(x, y):
    """ Возвращает результат возведения числа x в степень y.

    Именованные параметры:
    x -- действительное положительное число
    y -- целое отрицательное число

    """
    if (y >= 0) or (y % 1 != 0) or (x <= 0):
        return "Значение у должно быть целым отрицательным числом, " \
               "значение x - действительным положительным числом."
    else:
        x = [x]
        y = -1 * y
        my_list = x * y
        b = 1
        for i in my_list:
            b *= i
        return 1 / b


print(my_func(4, -4))
input('\nPress ENTER to exit')
