def sum_of_numbers():
    """ Возвращает сумму чисел, введенных пользователем в строку через пробел.

    При продолжении ввода чисел, разделенных пробелом, добавляет сумму вновь введенных чисел
    к уже подсчитанной сумме. Если вместо числа вводится специальный символ, выполнение программы завершается.
    Если специальный символ введен после нескольких чисел, то вначале функция добавляет сумму этих чисел
    к полученной ранее сумме и после этого завершает программу.
    Использует встроенные функции float(), input() и метод .split("").
    Параметры: пользователь вводит числа в виде строки (str). Программа выводит число типа float.

    """
    num_list = input("Введите числа через пробел ").split(" ")
    number_sum = 0
    for i in num_list:
        try:
            i = float(i)
            number_sum += i
        except SyntaxError and ValueError:
            break
    num_list_2 = input(f"Сумма введенных чисел равна {number_sum}. Введите числа через пробел ").split(" ")
    for a in num_list_2:
        try:
            a = float(a)
            number_sum += a
        except SyntaxError and ValueError:
            break
    return f"Сумма всех введенных чисел равна {number_sum}"


print(sum_of_numbers())
input('\nPress ENTER to exit')
